exercises/exercises.tex
% Created 2020-09-09 Wed 12:16
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath}\usepackage[margin=2.5cm]{geometry}\usepackage{ae,aecompl}\usepackage{sgame}
\usepackage{enumitem}
\author{Christoph Schottmüller}
\date{}
\title{Exercises}
\hypersetup{
 pdfauthor={Christoph Schottmüller},
 pdftitle={Exercises},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Introduction}
\label{sec:org214ddde}
\begin{enumerate}
\item Assume that the utility function \(u_i\) represents \(i\)'s preferences over a set of alternatives \(X=\{x_1,x_2,\dots,x_n\}\). Show that
\begin{enumerate}
\item \(i\)'s preferences are transitive;
\item the function \(v_i\) defined by \(v_i(x)=f(u_i(x))\) also represents \(i\)'s preferences if \(f\) is a strictly increasing function.
\item Assume now that there are only 2 alternatives, i.e. \(X=\{x_1,x_2\}\). Assume that there are 2 people in the society and person 1 prefers \(x_1\) over \(x_2\) while person 2 prefers \(x_2\) over \(x_1\). Choose some utility functions \(u_1\) and \(u_2\) to represent their preferences. Assume that society chooses the alternative \(x\) maximizing \(u_1(x)+u_2(x)\). 
\begin{itemize}
\item Which alternative does society choose with the utility functions you chose?
\item Show that a transformation as in the previous subquestion can change society's choice. What is the problem and how does it come about?
\end{itemize}
\end{enumerate}

\item Assume that there are \(m\) people in society and society has to choose an option from  \(X=\{x_1,x_2,\dots,x_n\}\). The preferences of each member of society can be represented by a utility function \(u_i\). Society chooses the alternative \(x\in X\) maximizing \(\sum_{i=1}^m u_i(x)\). Show that the chosen alternative is Pareto efficient.

\item Assume \(i\)'s preferences over lotteries on the set of outcomes \(\{healthy,\,ill,\,dead\}\) satisfy the assumptions of the von Neumann-Morgenstern expected utility theorem and can therefore be represented by three numbers \(u^{healthy},\,u^{ill}\) and \(u^{dead}\). Assume that  \(u^{healthy}=1,\,u^{ill}=0.75\) and \(u^{dead}=0\).
\begin{enumerate}
\item Treatment 1 leads to the probability distribution over \((0.3,0.5,0.2)\) (over \(\{healthy,\,ill,\,dead\}\)) while treatment 2 leads to the probability distribution \((0.4,0.3,0.3)\). Which treatment does \(i\) prefer?
\item Show that \(i\)'s preferences over lotteries can also be represented by the three numbers \(v^{healthy}=a*u^{healthy}+b\), \(v^{ill}=a*u^{ill}+b\) and \(v^{dead}=a*u^{dead}+b\) where \(a>0\) and \(b\in\Re\) are some real numbers.
\item Show by means of an example that \(i\)'s preferences are not necessarily represented by \(v^{healthy}=f(u^{healthy})\), \(v^{ill}=f(u^{ill})\) and \(v^{dead}=f(u^{dead})\) for some strictly increasing function \(f\). Why does this not contradict our result from exercise 1 above?
\end{enumerate}
\end{enumerate}

\section{Insurance demand}
\label{sec:orgfeb2401}
In all exercises let the person be an expected utility maximizer, i.e. the person's choices satisfy the assumptions of the von Neumann-Morgenstern expected utility theorem.

\begin{enumerate}[resume]
\item Consider a person with utility of income \(u(x)=\sqrt{x}\). Is this person risk averse? For the following lotteries, compute the expected income, the certainty equivalent and the risk premium.
\begin{enumerate}
\item Probability \(1/3\) for each \(1600\), \(2500\), and \(3600\) Euros.
\item Income is uniformly distributed between 1600 and 2500 Euros.
\end{enumerate}

\item Consider a person with utility of income \(u(x)=\sqrt{x}\). The person has an income of \(2500\) Euros but loses \(L\) Euros with probability \(\alpha\). Determine the certainty equivalent and the risk premium as a function of \(\alpha\) and \(L\). Is the risk premium increasing or decreasing in \(L\)? Is  the risk premium increasing or decreasing in \(\alpha\)?

\item Consider the utility function \(u(x)=-e^{-\eta x}\). The person has an income of \(1\) and experiences a loss of \(1\) with probability \(\alpha\).  The coefficient of absolute risk aversion is defined as \(-u''(x)/u'(x)\). Compute this coefficient. Let now \(\alpha=0.5\) and check whether the certainty equivalent in- or decreases in \(\eta\).

\item The Wall Street Journal reported in 2006 of "mini-medical insurance plans". These plans cover routine services, but little hospital coverage and usually have a cap on payouts (say of \$ 10.000 ). The premium, however, is only \$ 50 per month. Why might people buy a mini-medical plan? Why are such insurance plans not more popular (in a country where a substantial part of the population did/does not have health insurance)?

\item Consider a person with utility of income \(u(x)=\sqrt{x}\). The person has an income of \(2500\) Euros but loses \(1500\) Euros with probability \(1/4\). Assume there is an insurance company that offers to insure an arbitrary coverage \(C\in[0,1500]\) at premium \(pC\). Determine the amount of coverage \(C(p)\) that the person will buy. (If you find this too hard, let \(p\) be 0.3.)

\item Consider the same person as in the previous exercise. Let \(p=0.3\) and suppose the government guarantees a minimum income of 1500. Will the person still buy insurance? Discuss what features of the health care sector are similar to a minimum income guarantee in the model.
\end{enumerate}
