exercises/exercises.tex

\section{Selection}
\label{sec:org8ed30ca}
\subsection{Selection with fixed coverage}
\label{sec:orgd914bdf}
\begin{enumerate}[resume]
\item We now have a continuum of people of length \(1/2\). More precisely, we have a person \(i\) for each \(i\in[0,1/2]\). All people have the same utility function \(u(x)=\sqrt{x}\) and the same income of 2500. However, they differ in terms of risk: Person \(i\) loses 1600 with probability \(i\). We consider an insurance policy with full coverage, i.e. a policy that pays out 1600 in case of a loss. Every person knows his own risk but insurance companies cannot distinguish people (and will therefore have to offer the same premium to everybody). 
\begin{enumerate}
\item Determine the willingness to pay for the insurance of person \(i\).
\item For every possible insurance premium, how many people will buy insurance? Use your results to draw the demand for insurance.
\item Determine the marginal cost of person \(i\).
\item Determine the average cost of insuring all people \(i\geq j\), i.e. everyone in \([j,1/2]\).
\item If many risk neutral insurance companies with no administrative costs are active on this market, what is the market equilibrium?
\item Is the market equilibrium efficient? If not, determine the size of the inefficiency. What would be welfare in "first best", i.e. in a situation in which everyone with a willingness to pay above marginal cost gets insurance? Determine the relative inefficiency due to adverse selection.
\item Consider an insurance subsidy to insurers, i.e. each insurer receives for each sold insurance a subsidy payment \(s\). How high does \(s\) have to be to ensure efficiency?
\item Consider an insurance mandate (without subsidies), i.e. everyone is forced to buy an insurance contract. What is the equilibrium insurance premium? Who will benefit from the mandate? Who will lose out with the mandate?
\item Suppose insurers can now distinguish two groups: The people \(i\geq 0.3\) and the people \(i< 0.3\). Assume that insurers are allowed to offer different contracts to these two groups. Consequently, there are now two separate markets. What is the equilibrium on the "high risk market"? What is the equilibrium on the "low risk" market? Is the new situation more or less efficient than the one considered in the previous subquestions? Who benefits from groups discrimination and who does not?
\item With the previous subquestion in mind, what happens if insurers can identify people better? (For example, distinguish more and more subgroups as in the previous subquestion.) What are the consequences for welfare? Who benefits and who loses?
\end{enumerate}

\item You work for a profit maximizing health insurer which recently understood the problem of adverse selection. Your boss asks you what to do to increase/maintain profits in light of the adverse selection problem. What do you answer?
\end{enumerate}
