exercises/exercises.org
** Screening with coverage: Rothschild-Stiglitz
3. In this exercise we show that in the Rothschild-Stiglitz model only one contract per type can be sold in equilibrium. We do this by contradiction. Suppose this was not true, i.e. suppose there were two contracts $(p_1,q_1)$ and $(p_2,q_2)$ that are bought by consumers with high risk. 
  1. Draw in a coverage, premium diagram such two contracts and the indifference curve of the high risk consumers.
  2. Draw the isoprofit lines of the insurers through these contracts.
  3. Find a deviation contract that yields strictly positive profit (and is bought by some players if offered).
  4. Now suppose there were two contracts $(p_1,q_1)$ and $(p_2,q_2)$ that are bought by consumers with /low/ risk. Do the same as above but be careful when arguing that the deviation contract is strictly profitable.

4. In the Rothschild-Stiglitz model, assume that all consumers have the utility function $u(x)=-0.5x^2+10x$, that $W=9$, $L=5$, $\alpha_h=1/2$ and $\alpha_l=1/4$.
  1. Derive the isoprofit curve of an insurance company insuring a consumer with risk $\alpha$, i.e.   if coverage is $q$ what does the premium have to be to achieve expected profits of $\bar \pi$?
  2. Derive the consumer's indifference curve, i.e. if coverage is $q$ what does the premium have to be to achieve an expected utility of $\bar U$?
  3. Verify that the slope of the indifference curve of a consumer with higher risk is higher. Verify that the slope of the indifference curve is higher than the slope of the isoprofit curve for $q<1$ and equal for $q=1$.
  4. If risk types were observable what would be the equilibrium contracts for the two risk types?
  5. What is the Rothschild-Stiglitz equilibrium (i.e. the equilibrium when risk types are not observed by the insurance companies)? For which shares of high risk types is there a full coverage pooling contract breaking this equilibrium?  

5. Suppose the government mandates that coverage levels have to be at least $\bar q$. How does this affect the Rothschild-Stiglitz equilibrium? Who benefits/loses from this intervention?

6. Suppose that a low risk type is indifferent between his contract in the Rothschild-Stiglitz equilibrium candidate and a full coverage contract at premium $(\gamma\alpha_h+(1-\gamma)\alpha_l)*L$. What interpretation does the premium $(\gamma\alpha_h+(1-\gamma)\alpha_l)*L$ have? Demonstrate that in this case the Rothschild-Stiglitz equilibrium does not exist.

7. In the Netherlands, health insurance contracts can only be changed at the end of the calendar year. Discuss why such a regulation may or may not be a good idea. Do you know of other similar provisions or regulations?


# E1.1: \sqrt{2500-WTP}=i\sqrt{900}+(1-i)\sqrt{2500}, WTP=2000i-400i^2
# E1.2: 0 for p>=900; critical i: p=2000i-400i^2; i(p)=2.5-\sqrt{6.25-p/400}; D(p)= 1/2-i(p)= \sqrt{6.25-p/400}-2
# E1.3: MC(i)=i*1600; 
# E1.4: AC(j)=(1/2+j)*800
# E1.5: critical i: AC(i)=WTP(i); i = 1.5-\sqrt{5}/2\approx 0.38; hence i in [0.38,0.5] buy insurance
# E1.6: \int_{0.38}^{1/2}WTP(i)-MC(i)\,di=400[i^2/2-i^3/3]_0.33^{0.5}=11.584; welfare:  \int_{0}^{0.5}WTP(i)-MC(i)\,di=400[i^2/2-i^3/3]_0^{0.5}=33.333; proportional loss: (33.33-11.584)/33.33=0.653
# E1.7: AC^s(i)=AC(i)-s; equilibrium AC^s(i)=WTP(i); 800(.5+i)-s=2000i-400i^2; cover everyone means i=0 and therefore s=400.
# E1.8: p^*=AC(0) hence p=400, benefit if WTP(i)>=400, loose else; benefit if i>0.209
# E1.9: for i>0.3 same as original question; for i<0.3 AC(i)=(0.3+i)*800 and AC(i^*)=p*=WTP(i^*) gives i^*=0.225 and therefore p^*=420; people in (0.225,03.) benefit everyone else's utility is unchanged

# E1.10: Problem of adverse selection disappears as for a small enough subgroup the AC will be below WTP for all people in the subgroup, i.e. everyone will buy insurance (almost everyone to be precise: WTP(0)=0 so $i=0$ and people will not buy insurance if bunched together with others but that is a special case). WElfare will therefore increase. However, note that people in the top categories might experience higher premiums: If the highest subgroup is [a,0.5] and a>0.38, then their premium increases and they do not benefit.  i<0.38 will benefit

# E2: problem is that one attracts high cost customers; to avoid this, tailor your insurance plan toward healthy people (bonus programs for fitness courses; pay back part of the insurance premium when care was not used in a given year) and make it unattractive for chronically ill and unfit (signing of contract requires you to go to an office in the 3rd floor without an elevator or only online to get rid of the expensive elderly; have offices in neighborhoods with where people with high socioeconomic status live as they tend to be healthier; do not cover certain brands of medication for chronic diseases to which people may be already attached etc.)

# E3: By the no pooling result, both contracts are bought by h consumers only. As both isoprofit lines have to yield non-negative profits, there are contracts with $q\in(q_1,q_2)$ and a premium just above the indifference curve that are preferred by h to the two offered contracts and are strictly profitable if bought by h. Note that attracting l types to the deviation contract can only increase profits. 
# E3.4: Same as before but now one has to argue that the deviation contract does not attract h consumers. Note that this is true if the deviation contract is sufficiently close to the indifference curve of the low risk consumer as in this case h prefers the original contract with higher coverage to the deviation contract.  

# E4:1: pi=p-alpha qL; p=pi+alpha q L
# E4.2: for alpha = 1/2 only: U =1/2[-1/2 (9-p-(1-q)5)^2+10(9-p-(1-q)5]+1/2[-1/2(9-p)^2+10(9-p)] which yields 4U = 163-2p^2+60q-25q^2-14 p+10pq or p=(5q-7)/2 + \sqrt{375-25q^2+50q-8U}/2; for alpha = 1/4: p(q)=(5q-9)/4+\sqrt{1525-75q^2+150q-32 U}/4
# E4.3: direct differentiation in 4.2 yields p'(q)=5/2+50(1-q)/[4\sqrt{}] for alpha=1/2 and p'(q)=5/4+150(1-q)/[8\sqrt{}] which gives the result for q close to 1; however not very useful as one does not compare slope at same contract (unless "right" utility levels are chosen); better to use implicit function theorem which as in lecture yields p'(q|\mathbb{E}[u]=\bar u)= L\frac{u'(W-p-(1-q)L)}{u'(W-p-(1-q)L)+\frac{1-\alpha}{\alpha}u'(W-p)} which looks at slope through a given contract and clearly higher alpha leads to higher slope. For isoprofit comparison p'(q)>=alpha L with equality only for q=1
# E4.4: zero profits and full coverage i.e. q=1 and p=alpha L
# E4.5: h get full cov at zero profit, i.e. p_h=5/2 and q_h=1, leading to expected utility u(9-5/2)=43.875. zero profits for l imply p_l=q_l*5/4; h is indifferent between bot contracts, hence 43.875 = .5*u(9-p_l-5+5q)+.5 u(9-p_l), or q_l=0.3355.. p_l=0.4193...; this is broken by a full coverage pooling contract if gamma<0.33651...

# E5: 
# if \bar q below q_l^*, no effect
# if \bar q > q_l^* and RS eq existed and \bar q not too big, then new eq with same contract for h and (p,\bar q) where p is on h's indiff curve; this makes l worse off (his indiff is flatter than h's) and positive profits from l type for the insurance
# if \bar q too high, then no RS eq exists as potential eq (see above) is broken by pooling (both indifference curves lie above the pooling zero profit line)

# E6: point on zero profit pooling isoprofit for q=1; slope indiff l at q=1 is \alpha_l and therefore smaller than pooling isoprofit at 0 profit; hence deviation pooling contracts with q slightly below 1 exist

# E7: people switch from being low to being high risk and vice versa over time; if immediate change of plan is allowed people could buy the cheapest/no insurance and go to the plan with highest coverage the moment they fall ill; similar logic to German private plans that cover dental care only after 2 years

** Genetic tests
1. Assume that all people in our economy are similar and have the same Bernoulli utility function $u(x)=\sqrt{x}$. A person has wealth $W=9$ and falls ill with probability 1/2. When falling ill the person needs treatment costing $L=5$. Assume that many insurance companies without administrative costs compete perfectly in the insurance market.
  1. Determine the risk premium of a consumer for a full coverage contract. What contract be offered in equilibrium?
  2. Suppose a genetic test becomes available: The test results can be either "high risk" (h) or "low risk" (l). Those that test have a 50% chance of getting either result. High risk people have probability 3/4 and low risk people have the probability 1/4 of falling ill. 
    - Calculate the risk premium of an /h/ type and the risk premium of an /l/ type (again using a full coverage contract).
    - Assume everyone gets tested and the insurance companies can make their contracts dependent of the test result. What contracts will they offer? How do profits and expected utility change compared to (a)?
    - Assume that insurance companies are prohibited from making their contracts contingent upon the test results. How do expected utility and insurance profits change compared to (a)? (Note: you do not have to calculate the equilibrium contracts to answer this question qualitatively.) 
  3. Consider now a profit maximizing insurance monopolist. How does your answer in (a) and (b.1) and (b.2) change? 

# E1a: no insurance: E[u]:.5*\sqrt{9}+.5*\sqrt{9-5}=2.5; 2.5=\sqrt{9-.5*5-RP} or RP=1/4; full coverage and p=.5*5=2.5 EU=\sqrt{9-2.5}=2.55
# E1b:  no insurance h: E[u]:.25*\sqrt{9}+.75*\sqrt{9-5}=9/4; 9/4=\sqrt{9-.75*5-RP} or RP=3/16; full coverage p_h=.75*5
#  no insurance l: E[u]:.75*\sqrt{9}+.25*\sqrt{9-5}=11/4; 11/4=\sqrt{9-.25*5-RP} or RP=3/16; p_l=.25*5, q_l=1
#  observable tests: profits are zero by perfect competition in either case; expected utility of types is E[u_h]=\sqrt{9-15/4}=2.29 and E[u_l]=\sqrt{9-5/4}=2.78 and therefore on average 2.53 which is lower than without the test; this is because with the test only the risk of falling ill is insured but not the risk of having a high risk
#  private tests: Rothschild-Stiglitz equilibrium and therefore h type gets same contract as with observable test and l gets a contract he likes less compared to observable tests. Consequently, consumer surplus is lower than with observable tests and therefore also lower than without test. Profits are zero in all cases.

# c
# E1a: no insurance: E[u]:.5*\sqrt{9}+.5*\sqrt{9-5}=2.5; 2.5=\sqrt{9-.5*5-RP} or RP=1/4; p^{mon}=.5*5+1/4=2.75
# E1b:  no insurance h: E[u]:.25*\sqrt{9}+.75*\sqrt{9-5}=9/4; 9/4=\sqrt{9-.75*5-RP} or RP=3/16; p^{mon}_h=.75*5+3/16=63/16, q_h^{mon}=1
#  no insurance l: E[u]:.75*\sqrt{9}+.25*\sqrt{9-5}=11/4; 11/4=\sqrt{9-.25*5-RP} or RP=3/16; p^{mon}_l=.25*5+3/16=23/16, q_l^{mon}=1
#  monopolist with observability: pi=3/16 which is lower than without test where it was 1/4; expected utility of types is E[u_h]=9/4 and E[u_l]=11/4 and therefore on average the same as without test



