exercises/exercises.tex
\subsection{Screening with coverage: Rothschild-Stiglitz}
\label{sec:org800a0e5}
\begin{enumerate}[resume]
\item In this exercise we show that in the Rothschild-Stiglitz model only one contract per type can be sold in equilibrium. We do this by contradiction. Suppose this was not true, i.e. suppose there were two contracts \((p_1,q_1)\) and \((p_2,q_2)\) that are bought by consumers with high risk. 
\begin{enumerate}
\item Draw in a coverage, premium diagram such two contracts and the indifference curve of the high risk consumers.
\item Draw the isoprofit lines of the insurers through these contracts.
\item Find a deviation contract that yields strictly positive profit (and is bought by some players if offered).
\item Now suppose there were two contracts \((p_1,q_1)\) and \((p_2,q_2)\) that are bought by consumers with \emph{low} risk. Do the same as above but be careful when arguing that the deviation contract is strictly profitable.
\end{enumerate}

\item In the Rothschild-Stiglitz model, assume that all consumers have the utility function \(u(x)=-0.5x^2+10x\), that \(W=9\), \(L=5\), \(\alpha_h=1/2\) and \(\alpha_l=1/4\).
\begin{enumerate}
\item Derive the isoprofit curve of an insurance company insuring a consumer with risk \(\alpha\), i.e.   if coverage is \(q\) what does the premium have to be to achieve expected profits of \(\bar \pi\)?
\item Derive the consumer's indifference curve, i.e. if coverage is \(q\) what does the premium have to be to achieve an expected utility of \(\bar U\)?
\item Verify that the slope of the indifference curve of a consumer with higher risk is higher. Verify that the slope of the indifference curve is higher than the slope of the isoprofit curve for \(q<1\) and equal for \(q=1\).
\item If risk types were observable what would be the equilibrium contracts for the two risk types?
\item What is the Rothschild-Stiglitz equilibrium (i.e. the equilibrium when risk types are not observed by the insurance companies)? For which shares of high risk types is there a full coverage pooling contract breaking this equilibrium?
\end{enumerate}

\item Suppose the government mandates that coverage levels have to be at least \(\bar q\). How does this affect the Rothschild-Stiglitz equilibrium? Who benefits/loses from this intervention?

\item Suppose that a low risk type is indifferent between his contract in the Rothschild-Stiglitz equilibrium candidate and a full coverage contract at premium \((\gamma\alpha_h+(1-\gamma)\alpha_l)*L\). What interpretation does the premium \((\gamma\alpha_h+(1-\gamma)\alpha_l)*L\) have? Demonstrate that in this case the Rothschild-Stiglitz equilibrium does not exist.

\item In the Netherlands, health insurance contracts can only be changed at the end of the calendar year. Discuss why such a regulation may or may not be a good idea. Do you know of other similar provisions or regulations?
\end{enumerate}

\subsection{Genetic tests}
\label{sec:org5d61f90}
\begin{enumerate}[resume]
\item Assume that all people in our economy are similar and have the same Bernoulli utility function \(u(x)=\sqrt{x}\). A person has wealth \(W=9\) and falls ill with probability 1/2. When falling ill the person needs treatment costing \(L=5\). Assume that many insurance companies without administrative costs compete prefectly in the insurance market.
\begin{enumerate}
\item Determine the risk premium of a consumer for a full coverage contract. What contract be offered in equilibrium?
\item Suppose a genetic test becomes available: The test results can be either "high risk" (h) or "low risk" (l). Those that test have a 50\% chance of getting either result. High risk people have probability 3/4 and low risk people have the probability 1/4 of falling ill. 
\begin{itemize}
\item Calculate the risk premium of an \emph{h} type and the risk premium of an \emph{l} type (again using a full coverage contract).
\item Assume everyone gets tested and the insurance companies can make their contracts dependent of the test result. What contracts will they offer? How do profits and expected utility change compared to (a)?
\item Assume that insurance companies are prohibited from making their contracts contingent upon the test results. How do expected utility and insurance profits change compared to (a)? (Note: you do not have to calculate theequilibrium contracts to answer this question qualitatively.)
\end{itemize}
\item Consider now a profit maximizing insurance monopolist. How does your answer in (a) and (b.1) and (b.2) change?
\end{enumerate}
\end{enumerate}
