exercises/exercises.org
** Premium risk and risk adjustment
1. In Germany (private) health insurers are required to charge a constant premium over the life cycle. We use the premium risk model from the lecture: 2 periods, income $W$ in each period, everyone has low risk $\alpha_l$ of a loss $L$ in period 1, probability $1-\lambda$ of an increse of risk to $\alpha_h$ in period 2, perfect competition.
  1. Calculate the constant premium that yields zero expected profits to insurers under the assumption that no one switches insurers in period 2.
  2. Given the premium from the previous subquestion, what would happen if consumers could switch insurers in period 2?
  3. Compare the premium of the first subquestion with the premiums under "guaranteed renewal". What are the implications?
  4. Suppose now that in period 2 everyone's health deteriorates. More precisely, assume that the risk is $\alpha_m>\alpha_l$ with probability $\lambda$ and $\alpha_h>\alpha_m$ with probability $1-\lambda$. 
    - Calculate the constant premium that yields zero profits to insurers (without switching).
    - Compare it to the premiums with "guaranteed renewal". 

2. Discuss the advantages and disadvantages of using "last year health care expenditures of insured" as an explanatory variable in a risk adjustment scheme.

3. Suppose the population consists of two types /l/ and /h/ with the expenditure distribution for each type as in the table below. In this exercise we measure the incentive of an insurance to engage in risk selection by the difference in expected expenditures.
  1. Calculate the expected expenditures per risk type and the incentives to engage in risk selection.
  2. Consider a risk adjustment scheme that covers all expenditures above 20 (i.e. all expenditures above 20 are covered by some common fund to the extent that they exceed 20). Calculate the expected expenditures per risk type that an insurer has to cover himself and the incentives to engage in risk selection. What is the idea behind such a risk adjustment scheme?
  3. Consider a risk adjustment scheme that covers all expenditures up to 8 (i.e. all expenditures up to 8 are covered by some common fund). Calculate the expected expenditures per risk type that an insurer has to cover himself and the incentives to engage in risk selection. 
  4. Consider expenditure distributions that satisfy the following conditions: $p_h^{30}>p_l^{30}$ and $p_h^{10}+p_h^{30}\geq p_l^{10}+p_l^{30}$ where $p_h^{30}$ is the probability that a high risk type has expenditures 30 and so on. 
    - Show that the  incentive to engage in risk selection are decreased by a risk adjustment scheme as in (b) for all such distributions.
    - Show that the  incentive to engage in risk selection are decreased by a risk adjustment scheme as in (c) for all such distributions.

| risk/expenditure |   0 |  10 |  30 |
|------------------+-----+-----+-----|
| /                |   < |     |     |
| /l/              | 40% | 10% | 50% |
| /h/              | 10% | 50% | 40% |


# 4. In the USA a prediction model similar to the German risk adjustment scheme is used to predict expenditures for  Medicare recipients (Medicare: subsidized care for elderly). That is an HMO (combined health insurer and care provider) is paid an amount $x$ for enrolling Medicare recipient Mister X where $x$ depends on the predicted care cost for Mister X. Over the years the scheme was changed several times:
#  - First, the prediction model was based on age, gender, location and wheter Mister X is eligible for welfare payments and the amount $x$ was 95% of the predicted expenditures.
# - In 1997 Medicare was reformed and the prediction model includes a hierarchical condition categories model (used in addition to the former variables). 
# - In 2004 a bidding mechanism was introduced where the model gives a benchmark amount $x$. If an insurer offers a premium below this amount, the insurer keeps 75% of the saving while if the insurer offers a premium above the benchmark, he has to charge the amount above $x$ directly to the insured. 
# What were the objectives of the changes? Make the changes sense?

# 1.1: per period: $(\alpha_l+\lambda\alpha_l+(1-\lambda)\alpha_h)*L/2
# 1.2: low risks would want to switch as other insurers will offer a contract at premium $\alpha_l L<$(\alpha_l+\lambda\alpha_l+(1-\lambda)\alpha_h)*L/2$
# 1.3: show that $p_1^{guaranteed}>p^{const}>p_2^{guaranteed}$; hence budget constraint problems alleviated and better consumption smoothing
# 1.4: per period: $(\alpha_l+\lambda\alpha_m+(1-\lambda)\alpha_h)*L/2; guaranteed renewal premiums: p_1^g=\alpha_l L+(1-\lambda)(\alpha_h-\alpha_m)L and p_2^g=\alpha_m L; note that p^const can be below p_2^g if \alpha_m is large (close to \alpha_h); that is, it is not clear that budget constraints are relaxed more by constant premium 

# 2: ADVANTAGE: much higher prediction power as health care expenditure tend to be serially correlated (even when controlling for various health care conditions); if not doing so health insurers have a highly predictive variable on which they could try to select themselves (e.g. kicking out people with high expenditures int he previous year). DISADVANTAGE: reduced incentives for insurers to cut cost (high expenditure today translates to high payments from risk adjustment scheme next year) --> more waste has to be expected and therfore HCC is generally preferable to expenses; variable not available for new inflow (people from abroad kids etc.). BOTTOM LINE: at the very least, expenditure should not include administrative costs of the insurer, e.g. for claim handling, advertising etc., or costs of bonus benefits (like subsidy for fitness studio etc.)


# E3.1: l=16, h=17
# E3.2: l=11, h= 13 --> higher incentives for selection; take away incentives to not contract high risks
# E3.3: l=11.2, h=9.8 --> incentives for risk selection reversed and bigger than in (a); 
# E3.4: Conditions imply higher expected expenditures for h than for l as $p_l^{10}10+p_l^{30}*30=(p_l^{10}+p_l^{30})10+p_l^{30}*20\leq (p_h^{10}+p_h^{30})10+p_l^{30}*20<(p_h^{10}+p_h^{30})10+p_h^{30}*20=p_h^{10}10+p_h^{30}*30$.  By $p_h^{30}>p_l^{30}$, the subsidies from the fund are higher for a h than for l (while by a similar argument as for expected expenditures in baseline the expenditures are still higher for h than for l) --> lower incentives for risk selection. For the scheme in (c) note that this is a subsidy of 8 for everyone with expenditures greater than 8. As h is more likely to have expenditures above 8, he is more subsidized which reduces incentives for risk selection. More general point: first order stochastic dominance
** Advantageous selection

1. Compare adverse and advantageous selection. 

2. Let consumers have the utility function $u(x)=-e^{-\eta x}$. Each consumer faces a loss $L$ of his initial wealth $W$ with probability $\alpha$. While $W$ and $L$ are the same for all consumers, consumers differ in $\eta$ and $\alpha$. Let $W=10$ and $L=5$.
   1. Compare the willingness to pay for a full coverage insurance contract of two consumers: Consumer A has risk $\alpha_A=0.3$ and risk aversion $\eta_A=1$. Consumer B has risk $\alpha_B=0.2$ and risk aversion $\eta_B=1.5$. 
   2. Using otherwise the same parameters as in (a), who would have the higher willingness to pay if $\eta_B$ was 1 as well?
   3. Using otherwise the same parameters as in (a), who would have the higher willingness to pay if $\alpha_B$ was 0.3 as well?
   4. (PC exercise in spread sheet application or Julia) Let there be a continuum of consumers whose risk $\alpha$ is uniformly distributed on $[0.5,0.75]$. Assume that $\eta(\alpha)=3-\alpha$ and consider a full coverage insurance contract. Is this a case of adverse or advantageous selection? Repeat with $\eta(\alpha)=3-3.75\alpha$. 

3. Consider the fixed coverage model with perfect competition and no administrative costs for insurance companies. Assume that all consumers are risk averse. 
  1. How do the marginal cost, average cost and demand curve look in case of advantageous selection? 
  2. Is the market equilibrium efficient? 
  3. Consider now insurance companies with contracting and claim handling costs, i.e. each sold contract leads to expected administrative costs $c>0$. What is the market equilibrium and is it efficient?
  4. For the case with administrative costs, consider a tax on insurance premia (to be paid by consumer). What is the impact of this tax on welfare?

# E1: both about selection (who buys insurance); risk selection vs. risk aversion selection --> different implications for correlation insurance purchase and expected health care expenditures; reality seems to be a mix of both (see empirical evidence in lecture); difference in welfare implications: too few people buy insurance in adverse selection while this is not necessarily true under advantageous selection (e.g. not true under perfect competition)


# E2.1: see jupyter notebook, WTP_A=3.812, WTP_B=3.929
# E2.2:  WTP_B(eta=1)=3.417
# E2.3: WTP_B(alpha=.3)=4.198
# E2.4: WTP(alpha) increasing in first and decreasing in second case --> Adverse selection in first case and advantageous selection in second case

# E3.1: MC curve is increasing as those with high wtp have low costs, hence AC is increasing but with smaller slope and same intercept as MC, demand is downward sloping 
# E3.2: if everyone is risk averse WTP>MC everywhere and therefore also WTP>AC. equilibrium is that everyone is insured and premium equals population AC. this is efficient
# E3.3: Admin costs shift MC and AC parallelly up by c. If c is large enough AC+c intersects demand and the equilibrium is at this intersection point. If MC+c intersects demand, there are some people for who insurance is inefficient. In this case there is too much insurance in equilibrium.  
# E3.4: The tax t parallely shifts demand down. In case there is overinsurance in equilibrium, this can reduce the amount of overinsurance and can therefore be welfare enhancing (only if the collected tax is used for something useful of course, e.g. being paid back to consumers in a lump sum fashion but note that it is in this case redistributive as it redistributes money from those buying insurance to those who do not).

