exercises/exercises.tex



\subsection{Premium risk and risk adjustment}
\label{sec:org3d58a67}
\begin{enumerate}[resume]
\item In Germany (private) health insurers are required to charge a constant premium over the life cycle. We use the premium risk model from the lecture: 2 periods, income \(W\) in each period, everyone has low risk \(\alpha_l\) of a loss \(L\) in period 1, probability \(1-\lambda\) of an increse of risk to \(\alpha_h\) in period 2, perfect competition.
\begin{enumerate}
\item Calculate the constant premium that yields zero expected profits to insurers under the assumption that no one switches insurers in period 2.
\item Given the premium from the previous subquestion, what would happen if consumers could switch insurers in period 2?
\item Compare the premium of the first subquestion with the premiums under "guaranteed renewal". What are the implications?
\item Suppose now that in period 2 everyone's health deteriorates. More precisely, assume that the risk is \(\alpha_m>\alpha_l\) with probability \(\lambda\) and \(\alpha_h>\alpha_m\) with probability \(1-\lambda\). 
\begin{itemize}
\item Calculate the constant premium that yields zero profits to insurers (without switching).
\item Compare it to the premiums with "guaranteed renewal".
\end{itemize}
\end{enumerate}

\item Discuss the advantages and disadvantages of using "last year health care expenditures of insured" as an explanatory variable in a risk adjustment scheme.

\item Suppose the population consists of two types \emph{l} and \emph{h} with the expenditure distribution for each type as in the table below. In this exercise we measure the incentive of an insurance to engage in risk selection by the difference in expected expenditures.
\begin{enumerate}
\item Calculate the expected expenditures per risk type and the incentives to engage in risk selection.
\item Consider a risk adjustment scheme that covers all expenditures above 20 (i.e. all expenditures above 20 are covered by some common fund to the extent that they exceed 20). Calculate the expected expenditures per risk type that an insurer has to cover himself and the incentives to engage in risk selection. What is the idea behind such a risk adjustment scheme?
\item Consider a risk adjustment scheme that covers all expenditures up to 8 (i.e. all expenditures up to 8 are covered by some common fund). Calculate the expected expenditures per risk type that an insurer has to cover himself and the incentives to engage in risk selection.
\item Consider expenditure distributions that satisfy the following conditions: \(p_h^{30}>p_l^{30}\) and \(p_h^{10}+p_h^{30}\geq p_l^{10}+p_l^{30}\) where \(p_h^{30}\) is the probability that a high risk type has expenditures 30 and so on. 
\begin{itemize}
\item Show that the  incentive to engage in risk selection are decreased by a risk adjustment scheme as in (b) for all such distributions.
\item Show that the  incentive to engage in risk selection are decreased by a risk adjustment scheme as in (c) for all such distributions.
\end{itemize}
\end{enumerate}
\end{enumerate}

\begin{center}
\begin{tabular}{l|lll}
risk/expenditure & 0 & 10 & 30\\
\hline
\emph{l} & 40\% & 10\% & 50\%\\
\emph{h} & 10\% & 50\% & 40\%\\
\end{tabular}
\end{center}
\subsection{Advantageous selection}
\label{sec:orgc9842fb}

\begin{enumerate}[resume]
\item Compare adverse and advantageous selection.

\item Let consumers have the utility function \(u(x)=-e^{-\eta x}\). Each consumer faces a loss \(L\) of his initial wealth \(W\) with probability \(\alpha\). While \(W\) and \(L\) are the same for all consumers, consumers differ in \(\eta\) and \(\alpha\). Let \(W=10\) and \(L=5\).
\begin{enumerate}
\item Compare the willingness to pay for a full coverage insurance contract of two consumers: Consumer A has risk \(\alpha_A=0.3\) and risk aversion \(\eta_A=1\). Consumer B has risk \(\alpha_B=0.2\) and risk aversion \(\eta_B=1.5\).
\item Using otherwise the same parameters as in (a), who would have the higher willingness to pay if \(\eta_B\) was 1 as well?
\item Using otherwise the same parameters as in (a), who would have the higher willingness to pay if \(\alpha_B\) was 0.3 as well?
\item (PC exercise in spread sheet application or Julia) Let there be a continuum of consumers whose risk \(\alpha\) is uniformly distributed on \([0.5,0.75]\). Assume that \(\eta(\alpha)=3-\alpha\) and consider a full coverage insurance contract. Is this a case of adverse or advantageous selection? Repeat with \(\eta(\alpha)=3-3.75\alpha\).
\end{enumerate}

\item Consider the fixed coverage model with perfect competition and no administrative costs for insurance companies. Assume that all consumers are risk averse. 
\begin{enumerate}
\item How do the marginal cost, average cost and demand curve look in case of advantageous selection?
\item Is the market equilibrium efficient?
\item Consider now insurance companies with contracting and claim handling costs, i.e. each sold contract leads to expected administrative costs \(c>0\). What is the market equilibrium and is it efficient?
\item For the case with administrative costs, consider a tax on insurance premia (to be paid by consumer). What is the impact of this tax on welfare?
\end{enumerate}
\end{enumerate}
