exercises/exercises.org
* Moral Hazard

1. Ambulatory mental health care was the most price sensitive element of health care in the RAND health insurance experiment. How do you think the market for mental health care has changed since the 1970s? How does this affect the price sensitivity? What evidence would you look for to support your claims?

2. Dental care was quite price sensitive in the RAND health insurance experiment. This effect was particularly large in the first year. What is the explanation for this? What are the implications?

3. Health insurance plans can often be described by a deductible $D$, a copayment rate $c$ and a maximal out of pocket amount $M$: Up to $D$ all expenditures are paid by the insured, for every $ spent between $D$ and $M$ the insured pays $c$ and the insurance bears all expenses above $M$.[fn:: Hence, the total copayment if expenditures are $x$ is $x$ if $x\leq D$; is $D+c(x-D)$ if $D<x<M$ and is $D+c(M-D)$ for $x\geq M$.] Assume that consumers act as to maximize the utility function $cons-0.5(2-s-t)^2$ where $cons$ is consumption, i.e. all money left to the consumer after paying for treatment $t\in[0,2-s]$, and $s\leq1$ is a health state. Assume that the consumer has an initial wealth of 4 (net of the insurance premium) and therefore consumption is $4-t$ if he has no insurance.
  1. Suppose the consumer has no insurance (or equivalently $D>4$). How much treatment will he buy in health state $s\in[0,1]$?
  2. Suppose the consumer has a coinsurance rate of $c\in[0,1)$ while $D=0$ and $M=\infty$. How much treatment will he buy in health state $s\in[0,1]$?
  3. Now let $D=0.5$, $c=1/2$ and $M=\infty$. How much treatment will the consumer buy in health state $s\in[0,1]$?
  4. Think now about expected expenditure at the time of insurance purchase (i.e. we do not know the health state yet). Under which conditions on the distribution of health states will an increase in the deductible reduce expected expenditures? What does this imply for the effectiveness of small deductibles in reducing expected expenditures?

4. Suppose a study like the RAND health insurance experiment could be redone for $ 200 million. On what should the new study focus, i.e. how should it be different from the old one? Do you think it would be worth the money?

5. A consumer has wealth $W=64$ and face a potential loss of $L=15$. The consumer has to decide whether to "be careful" or not. If he is careful, the loss realizes with probability $1/4$. If he is not careful, the loss realizes with probability $1/2$. Being careful costs (the money equivalent of) 1 unit of income. (The consumer is a risk averse expected utility maximizer and you can assume $u(x)=\sqrt{x}$.)  
  1. Consider the situation where the consumer is not insured. Will he be careful?
  2. Consider the situation where the consumer is fully insured at premium $p>0$. Will he be careful?

6. A consumer with Bernoulli utility $u(x)=-x^2+10x$ has wealth $W=4$ and faces a potential (money equivalent) loss $L=2$ which realizes with probability $\alpha=1/2$. If the loss realizes the consumer can (partially) make up for the loss by treatment $M\in[0,2]$. The insurance will cover $qM$ of these treatment expenditures for some coverage rate $q\in[0,1]$. Treatment $M$ will mitigate the loss to $L-2M+M^2/2$.
  1. If the consumer is ill, what treatment intensity $M^*(q)$ will he choose?
  2. (numerical) Assume that the insurance premium is fair, i.e. $p=\alpha q M^*(q)$. Write down the consumers expected utility. Which $q$ maximizes expected consumer utility? How and why does this result differ from models without moral hazard? 

7. Consider the following case: "I met Jane at a gas station in the outskirts of Oklahoma City where she was filling up her 8 year old Chevrolet. She was in her fourties and when I asked for the way she was happy to help me out. The moment she talked it became apparent that some of her teeth were missing which impeded her speech slightly (the pronounciation of "s" was a bit off). As a result, I misunderstood her first and had to ask her to repeat. The second time I got it and apologized for my earlier misunderstanding. 'Don't worry, it happens all the time. Ever since I had the tooth thing three years ago. It hurt so bad...After two days I begged my brother to pull them out.' she said. 'I see. Did it help?' I asked politely. 'Well first he did not want to do it. But after another day he said yes. It was terrible. He did not get them first time and then it hurt even more and there was lots of blood. But, yeah, it got better when they were out.' It took me a second to follow but then it dawned on me: 'I guess your brother is  not a dentist...' 'No, of course not,' Jane laughed, 'he did his best. I called the dentist but they said it was 500$. I mean, who can pay that if you have no insurance, you know.'"
  - Discuss whether Jane should have had a dentist to treat her toothache from a welfare perspective.

# E1: "The idea here is that if the price responsiveness has declined over time, then one would expect health insurers to be among the first to see this and to begin reducing the distinctions between mental health coverage and medical coverage even in the absence of mental health parity requirements (see Chapter 18). The danger in this argument, however, is that health insurers seem to have been doing some pretty unproductive things in utilization management (see Chapter 8), so the argument here may be a bit disingenuous." (Morrisey);  psychiatry has turned heavily towards psychopharmaca and away from psychology (unclear whether this makes demand less price sensitive); maybe less social stigma of mental health care nowadays (again not totally clear how this affects price sensitivity); regulatory environment has changed (maybe it is harder today to get a renewal of a prescription)

# E2: "The differential response for dental care almost certainly reflects the equivalent of adverse selection in the sense that the randomly enrolled people were less likely to have had dental coverage and took advantage of the new coverage to obtain care they had deferred obtaining." (Morrisey); studies need a sufficiently long time horizon to give reliable results


# E3.1: MB=2-s-t while MC=1; t_1=1-s if s\in[0,1] and t=0 else
# E3.2:  MB=2-s-t while MC=c; t_c=2-c-s if s\in[0,2-c] and t=0 else
# E3.3: MB=2-s-t while MC either 1 or c.  \max_t 4-copay-.5(2-s-t)^2; "solution" t=1-s if t<.5 and t=1.5-s if t>.5. Note that the first is only possible/consistent if s>0.5 and the second is always consistent. Hence, we only have to figure out which of the two yields highere utility if s\in[0.5,1]. u(1-s|s\in[0.5,1])=4-(1-s)-.5(1)^2=2.5+s while u(1.5-s|s\in[0.5,1])=4-(.5+(1.5-s)/2)-.5(1.5)^2=2.875+s/2. Hence, t=1.5 -s if s<.75 and t=1-s if s>.75 . draw graph t(s). Important conclusion: Expenditures are never close to the deductible, i.e. there is a jump = testable prediction of the model, if we can find this jump in data we know that health demand depends on premium, i.e. moral hazard exists
# E3.4: Say we increase from D_1 to D_2. Then expenditures are only affected if health states in which we want to spend between D_1 and D_2 (under deductible D_1) have positive probability. Otherwise there is no difference between D_1 and D_2. This implies that small deductibles have hardly an effect as they can prevent only small expenditures and have no effect on big spenders that cause the majority of the health care expenditures.


# E4: "While expensive, the RAND study was about as costly as a promising new drug development by a pharmaceutical company. So undertaking a new study is not beyond the realm of possibility. From my perspective, a new RAND study would focus on managed care and consumer-directed healthcare models rather than conventional coverage with, perhaps, greater attention to the potential for consumers to shop for value in healthcare. It would focus more on prescription drugs and any inpatient care that may (or may not) be prevented with generous drug benefits. It would focus more on modern mental health treatment approaches." (Morrisey) Health saving accounts; other forms of cost sharing (Quartalspauschale in Deutschland); maybe focus on deductibles instead of coinsurance rates


# E5: no insurance: EUcare=3/4 u(W-1)+ 1/4 u(W-L-1)=7.68; EUno=1/2 u(W) +1/2 u(W-L)=7.5 
# insurance: EUcare=u(W-p-1); EUno=u(W-p); hence not careful, this is ex ante moral hazard
# note that being careful is socially very beneficial as expected benefit is 15/4 and costs only 1


# E6.1: max_M W-L-p-L+2M-M^2/2-(1-q)M leading to foc 2-M-(1-q)=0 or M*=1+q
# E6.2: see julia notebook; q<1 exposes the risk averse consumer to risk (downside) but reduces moral hazard, i.e. the consumption of inefficient care, (upside). As the consumer eventually has to pay for all his anticipated expenditures (including the inefficient ones), it can be in his interest to have partial coverage only. Partial coverage acts like a commitment not to overconsume too much.

# E7: Jane has no insurance and did not see a dentist. Hence, her willingness to pay is below the cost of a dentist and it is most efficient for her not to see a dentist. There can be several objections to this: First, maybe she is unable to pay and the whole thing is more a question of ability than of willingness to pay. Note, however, that Jane has a car that would have fetched more than 500$ if she had sold it. Hence, there was a choice and it is not a question of "ability to pay". One may find this argument objectionable ("one should not have to sell one's car to get treatment") but this illustrates another point: Poor people make different choices than rich people. Put differently, 1$ is worth more to a poor than a rich person and therefore the rich person may find some choices (500$ for a dental treatment) clearly advantageous that a poor person does not. It seems that maybe the thing you are objecting to is in fact poverty itself (or the lack of a social welfare system in the US). Should there be a social health insurance paying for Jane's treatment? Well, in this case we use the health insurance to redistribute wealth. This has disadvantages: Suppose, we gave Jane 500$ in cash at the time she had the toothache. The question is now whether she would have spent these 500$ on a dentist or preferred the non-professional version and used the 500$ for things she considers more important. In the latter case, providing her with health insurance is inefficient. For this reason, wealth redistribution is better done through the tax and transfer system where cash is redistributed and people decide themselves what to do with it (buy health insurance, treatments or something else). Incorporating redistributive elements in the health care system makes it difficult to establish what is efficient and what not. That is, true inefficiencies may hide behind the excuse of being elements of redistribution. (There is also the problem that redistributiong in several systems makes redistribution intransparent and consequently hard to measure and evaluate which is problematic for accountability of democratically elected politicians).
# There is a slightly more economic way to justify why Jane should be covered by some social health insurance system. This would be to argue with negative externalities of non-treatment. In case of dental care, the externalities may be not so pronounced (though not understanding at first what she says certainly is an externality!) but for infectious diseases things may very well be different.

