exercises/exercises.tex

\section{Moral Hazard}
\label{sec:orga02ced4}

\begin{enumerate}[resume]
\item Ambulatory mental health care was the most price sensitive element of health care in the RAND health insurance experiment. How do you think the market for mental health care has changed since the 1970s? How does this affect the price sensitivity? What evidence would you look for to support your claims?

\item Dental care was quite price sensitive in the RAND health insurance experiment. This effect was particularly large in the first year. What is the explanation for this? What are the implications?

\item Health insurance plans can often be described by a deductible \(D\), a copayment rate \(c\) and a maximal out of pocket amount \(M\): Up to \(D\) all expenditures are paid by the insured, for every \$ spent between \(D\) and \(M\) the insured pays \(c\) and the insurance bears all expenses above \(M\).\footnote{Hence, the total copayment if expenditures are \(x\) is \(x\) if \(x\leq D\); is \(D+c(x-D)\) if \(D<x<M\) and is \(D+c(M-D)\) for \(x\geq M\).} Assume that consumers act as to maximize the utility function \(cons-0.5(2-s-t)^2\) where \(cons\) is consumption, i.e. all money left to the consumer after paying for treatment \(t\in[0,2-s]\), and \(s\leq1\) is a health state. Assume that the consumer has an initial wealth of 4 (net of the insurance premium) and therefore consumption is \(4-t\) if he has no insurance.
\begin{enumerate}
\item Suppose the consumer has no insurance (or equivalently \(D>4\)). How much treatment will he buy in health state \(s\in[0,1]\)?
\item Suppose the consumer has a coinsurance rate of \(c\in[0,1)\) while \(D=0\) and \(M=\infty\). How much treatment will he buy in health state \(s\in[0,1]\)?
\item Now let \(D=0.5\), \(c=1/2\) and \(M=\infty\). How much treatment will the consumer buy in health state \(s\in[0,1]\)?
\item Think now about expected expenditure at the time of insurance purchase (i.e. we do not know the health state yet). Under which conditions on the distribution of health states will an increase in the deductible reduce expected expenditures? What does this imply for the effectiveness of small deductibles in reducing expected expenditures?
\end{enumerate}

\item Suppose a study like the RAND health insurance experiment could be redone for \$ 200 million. On what should the new study focus, i.e. how should it be different from the old one? Do you think it would be worth the money?

\item A consumer has wealth \(W=64\) and face a potential loss of \(L=15\). The consumer has to decide whether to "be careful" or not. If he is careful, the loss realizes with probability \(1/4\). If he is not careful, the loss realizes with probability \(1/2\). Being careful costs (the money equivalent of) 1 unit of income. (The consumer is a risk averse expected utility maximizer and you can assume \(u(x)=\sqrt{x}\).)  
\begin{enumerate}
\item Consider the situation where the consumer is not insured. Will he be careful?
\item Consider the situation where the consumer is fully insured at premium \(p>0\). Will he be careful?
\end{enumerate}

\item A consumer with Bernoulli utility \(u(x)=-x^2+10x\) has wealth \(W=4\) and faces a potential (money equivalent) loss \(L=2\) which realizes with probability \(\alpha=1/2\). If the loss realizes the consumer can (partially) make up for the loss by treatment \(M\in[0,2]\). The insurance will cover \(qM\) of these treatment expenditures for some coverage rate \(q\in[0,1]\). Treatment \(M\) will mitigate the loss to \(L-2M+M^2/2\).
\begin{enumerate}
\item If the consumer is ill, what treatment intensity \(M^*(q)\) will he choose?
\item (numerical) Assume that the insurance premium is fair, i.e. \(p=\alpha q M^*(q)\). Write down the consumers expected utility. Which \(c\) maximizes expected consumer utility? How and why does this result differ from models without moral hazard?
\end{enumerate}

\item Consider the following case: "I met Jane at a gas station in the outskirts of Oklahoma City where she was filling up her 8 year old Chevrolet. She was in her fourties and when I asked for the way she was happy to help me out. The moment she talked it became apparent that some of her teeth were missing which impeded her speech slightly (the pronounciation of "s" was a bit off). As a result, I misunderstood her first and had to ask her to repeat. The second time I got it and apologized for my earlier misunderstanding. 'Don't worry, it happens all the time. Ever since I had the tooth thing three years ago. It hurt so bad\ldots{}After two days I begged my brother to pull them out.' she said. 'I see. Did it help?' I asked politely. 'Well first he did not want to do it. But after another day he said yes. It was terrible. He did not get them first time and then it hurt even more and there was lots of blood. But, yeah, it got better when they were out.' It took me a second to follow but then it dawned on me: 'I guess your brother is  not a dentist\ldots{}' 'No, of course not,' Jane laughed, 'he did his best. I called the dentist but they said it was 500\$. I mean, who can pay that if you have no insurance, you know.'"
\begin{itemize}
\item Discuss whether Jane should have had a dentist to treat her toothache from a welfare perspective.
\end{itemize}
\end{enumerate}
