exercises/exercises.org
** Utilization management
1. Assume for simplicity that a consumer needs to go to hospital exactly once per year. When he goes to hospital, a /long stay/ is appropriate with probability $1/2$ and a /short stay/ is appropriate with probability $1/2$. The costs of a long (short) stay are $c_l$ ($c_s$) with $c_l>c_s$. The hospital has idle capacity and prefers if the consumer stays long. The consumer cannot judge whether a short or a long stay is more appropriate but the hospital knows this perfectly. Assume that there is perfect competition on the insurance market, i.e. insurance premia equal expected cost, that only full coverage contracts are allowed and that insurers have no administrative costs. 
  1. Assume that the hospital determines the length of the stay. What is the equilibrium on this market, i.e. how long will the consumer stay and what is the insurance premium?
  2. Now assume that the insurer engages in utilization management, in particular assume that the insurer decides whether the stay is short or long. Assume that the insurer does not know which length of stay is appropriate but he has some information on this: More precisely, assume that the insurer's perception of which lenght of stay is appropriate is correct with probability $\alpha>1/2$. What is the equilibrium insurance premium if the insurer uses his perception?
  3. Assume that the consumer has utility 1 if the length of his stay is at least as long as appropriate but 0 if he has a short stay and a long one would have been appropriate. The consumer maximizes expected utility from health minus the insurance premium. Is the consumer better off with or without utilization management? Reconsider what the equilibrium is when utilization management is possible.

# E1.1: hospital always enforces long stay, premium = c_l
# E1.2: if insurer follows his perception, then long stay with probability 0.5*\alpha+0.5*(1-\alpha)=0.5 and premium equals 0.5*c_l+0.5*c_s; note that the insurer also could decide to always pay for a long stay (see the next subquestion)
# E1.3: EU_h=1-c_l; EU_i=0.5*(\alpha*1+(1-\alpha)*0)+0.5*1-(0.5*c_l+0.5*c_s)=0.5*(1+\alpha-c_l-c_s); EU_h>EU_i iff \alpha<1-(c_l-c_s). Hence, if \alpha is sufficiently large UM is better than no UM. Equilibrium with UM, note that if UM is allowed but not optimal, then the equilibrium is that insurers do not use UM!


* Doctor-patient interaction
** Supplier induced demand
1. In the "first wave" model of the lecture, consider the case where marginal utility of income is constant, i.e. $u(y,t,s)=y-t-\gamma s$.
  1. How much demand will the physician induce in this case?
  2. Plot billed services per patient as a function of $\delta$.
  3. Consider now that inducing an additional unit of demand may be a lot harder if you already induce a lot compared to the situation where you already induce a lot. Use $u(y,t,s)=y-t-0.5\gamma s^2$ to capture this situation. How does this change your answer to the previous two questions?
  4. How does the shape of billed services per patient as a function of \delta differ from that in the lecture where we assumed decreasing marginal utility of income?

2. Upcoding is the practice of fraudently charging for higher paying services than the ones provided. Discuss similarities and differences between upcoding and inducing demand.

3. A clinic offers 2 services. Demand for service $i$ is $M_i+s_i$ where $M_i>0$ is the primary demand and $s_i$ is the induced demand for service $i\in\{1,2\}$. Let the objective of the clinic be $u(y,s_1,s_2)=-e^{-\eta y}-0.5 s_1^2-0.5 s_2^2$ where $y=(M_1+s_1)p_1+(M_2+s_2)p_2$ is revenue of the clinic as $p_i$ are the profit margins for the two services and $\eta>0$ is a parameter.
  1. What is the optimal proportion of inducement levels, i.e.  $s_1/s_2$, that the clinic will choose?
  2. Will an increase in $p_1$ in- or decrease the optimal inducement levels $s_1$ and $s_2$?
  3. In Germany, the physician price for providing a given service to a patient insured in the private arm of the health insurance system is 2.3 times the price of providing the same service to a patient administered in the public arm. What does the model predict in terms of demand inducement? 

4. A clinic offer 2 services. Demand for service $i$ is $M_i+s_i$ where $M_i>0$ is the primary demand and $s_i$ is the induced demand for service $i\in\{1,2\}$. The two services are offered in separate units. Each unit has a leader who chooses the inducement level of this unit. The unit leader receives an income bonus that depends positively on the revenues of his own unit an negatively on the revenues of the other unit (e.g. there is some relative performance bonus). The head of unit $i$ maximizes therefore the utility function $2\sqrt{p_i(1+s_i)-\alpha p_j(1+s_j)}-s_i$ where $\alpha\in(0,1)$ is a parameter measuring the magnitude of relative performance pay. 
  1. Assume $p_1=p_2=1$ and derive the optimal inducement levels the unit leaders will choose.
  2. Assume $p_1=1.1$ and $p_2=1$ and let $\alpha=1/2$. Derive the optimal inducement levels the unit leaders will choose.
  3. Compare your results with the results in exercise 3.


# E1.1: if M/\delta\geq 1, then s=0; if M/\delta<1: if p-1-gamma<0 again s=0, if p-1-\gamma>0 then s=1-M/\delta
# E1.2: for delta\leq M 45° line; for \delta>M two cases: if p-1-gamma<0, then constant at M, if p-1-gamma>0, then continuing as 45° line
# E1.3: 
# interior candidate solution s= (p-1)/\gamma; if M/\delta\geq 1, then s=0; if M/\delta<1: if p<1 then s=0, if p>1, then s=min((p-1)/gamma,1-M/\delta)
# 45° line for delta<M; if p<1, then constant at M for delta>M; if p>1, then continue on 45° up to \delta=M/(1-(p-1)/gamma) (if this is a number greater M) and from there on services per patient are M+\delta (p-1)/\gamma
# E1.4: that pattern of increasing, then flat, then increasing again is not possible with constant marginal utility of income. It was possible in lecture as on the flat bit income was high that inducement was not optimal but as delta increased further income went so much down that MU of income became high enough to make inducement optimal

# E2: incentive structure of upcoding is similar. It increases income but has a cost that can be interpreted either as a moral cost or the probability of detection times the value of the expected punishment in case of detection. To make inducement possible the physician needs superior knowledge about what service is right; to make upcoding possible the physician needs superior knowledge over either the service provided or the service billed (think of direct biloing to insurers where the patient may not even see the bill). The model could very well be reinterpreted as a model of upcoding. However, the most important difference is that the patient is overtreated in case of supplier induced demand but not in case of upcoding. If overtreatment implies a health risk, supplier induced demand can reduce welfare as a consequence. Upcoding is merely about redistributing money (i.e. if everyone had the same constant marginal utility of income, there would be no welfare effect of upcoding).

# E3.1: foc: \eta e^{-\eta y}p_1-s_1=0 and \eta e^{-\eta y}p_2-s_2=0 this yields $s_1/s_2 = p_1/p_2$
# E3.2: if $p_1$ increases, y has to increase: if y decreased, then by the focs both s_1 and s_2 would increase which would yield a higher y. As y increases, s_2 decreases from the foc. The effect on s_1 is a priori unclear as a higher  p_1 leads to a substitution effect increasing s_1 but also to an income effect reducing s_1 (as y increases). However one can get more precise results here:
# plug $s_2=s_1*p_2/p_1$ into $y$ to get $y=p_1(M_1+s_1)+p_2(M_2+s_1p_2/p_1)$ and use IFT on the foc for s_1 to get $ds_1/dp_1=-(v'(y)+p_1v''(y)dy/dp_1)/(v''(y)dy/ds_1-1)=-v'(y)*[1-\eta p_1 dy/dp_1]/[v''(y)dy/ds_1-1]$ where $v(y)=-e^{-\eta y}$. Note that the denominator is negative while the numerator depends on \eta: If \eta is large it is negative, if \eta is small it is positive.
# E3.3: Private patients will receive 2.3 times as much demand inducement as publicly insured patients. If the 2.3 multiplier would be reduced, more demand inducement of publicly insured would result.


# E4.1: foc: 1+s_i-\alpha(1+s_j)=1 with the symmetric solution s_i=\alpha/(1-\alpha)
# E4.2: 1.21=1.1(1+s_1)-\alpha(1+s_2) and 1=1+s_2-\alpha 1.1(1+s_1) which yields for \alpha=1/2 s_2=1.14
# E4.3: S_2 increases as a response to an increase in p_1 while it decreased in E3. The reason is that a higher p_1 makes it easier for unit 1 to generate revenue and the unit leader of unit 2 tries to compensate by inducing more. This is a problem for study designs asin the second wave of SID studies: If decisions are made by competing units, price increases in one service can then increase inducement in other services.

# ** Credence goods
