exercises/exercises.tex

\subsection{Utilization management}
\label{sec:orge6b3acd}
\begin{enumerate}[resume]
\item Assume for simplicity that a consumer needs to go to hospital exactly once per year. When he goes to hospital, a \emph{long stay} is appropriate with probability \(1/2\) and a \emph{short stay} is appropriate with probability \(1/2\). The costs of a long (short) stay are \(c_l\) (\(c_s\)) with \(c_l>c_s\). The hospital has idle capacity and prefers if the consumer stays long. The consumer cannot judge whether a short or a long stay is more appropriate but the hospital knows this perfectly. Assume that there is perfect competition on the insurance market, i.e. insurance premia equal expected cost, that only full coverage contracts are allowed and that insurers have no administrative costs. 
\begin{enumerate}
\item Assume that the hospital determines the length of the stay. What is the equilibrium on this market, i.e. how long will the consumer stay and what is the insurance premium?
\item Now assume that the insurer engages in utilization management, in particular assume that the insurer decides whether the stay is short or long. Assume that the insurer does not know which length of stay is appropriate but he has some information on this: More precisely, assume that the insurer's perception of which lenght of stay is appropriate is correct with probability \(\alpha>1/2\). What is the equilibrium insurance premium if the insurer uses his perception?
\item Assume that the consumer has utility 1 if the length of his stay is at least as long as appropriate but 0 if he has a short stay and a long one would have been appropriate. The consumer maximizes expected utility from health minus the insurance premium. Is the consumer better off with or without utilization management? Reconsider what the equilibrium is when utilization management is possible.
\end{enumerate}
\end{enumerate}


\section{Doctor-patient interaction}
\label{sec:org8b973cb}
\subsection{Supplier induced demand}
\label{sec:org8ca64a8}
\begin{enumerate}[resume]
\item In the "first wave" model of the lecture, consider the case where marginal utility of income is constant, i.e. \(u(y,t,s)=y-t-\gamma s\).
\begin{enumerate}
\item How much demand will the physician induce in this case?
\item Plot billed services per patient as a function of \(\delta\).
\item Consider now that inducing an additional unit of demand may be a lot harder if you already induce a lot compared to the situation where you already induce a lot. Use \(u(y,t,s)=y-t-0.5\gamma s^2\) to capture this situation. How does this change your answer to the previous two questions?
\item How does the shape of billed services per patient as a function of \(\delta\) differ from that in the lecture where we assumed decreasing marginal utility of income?
\end{enumerate}

\item Upcoding is the practice of fraudently charging for higher paying services than the ones provided. Discuss similarities and differences between upcoding and inducing demand.

\item\label{ex:sid2service} A clinic offers 2 services. Demand for service \(i\) is \(M_i+s_i\) where \(M_i>0\) is the primary demand and \(s_i\) is the induced demand for service \(i\in\{1,2\}\). Let the objective of the clinic be \(u(y,s_1,s_2)=-e^{-\eta y}-0.5 s_1^2-0.5 s_2^2\) where \(y=(M_1+s_1)p_1+(M_2+s_2)p_2\) is revenue of the clinic as \(p_i\) are the profit margins for the two services and \(\eta>0\) is a parameter.
\begin{enumerate}
\item What is the optimal proportion of inducement levels, i.e.  \(s_1/s_2\), that the clinic will choose?
\item Will an increase in \(p_1\) in- or decrease the optimal inducement levels \(s_1\) and \(s_2\)?
\item In Germany, the physician price for providing a given service to a patient insured in the private arm of the health insurance system is 2.3 times the price of providing the same service to a patient administered in the public arm. What does the model predict in terms of demand inducement?
\end{enumerate}

\item A clinic offer 2 services. Demand for service \(i\) is \(M_i+s_i\) where \(M_i>0\) is the primary demand and \(s_i\) is the induced demand for service \(i\in\{1,2\}\). The two services are offered in separate units. Each unit has a leader who chooses the inducement level of this unit. The unit leader receives an income bonus that depends positively on the revenues of his own unit an negatively on the revenues of the other unit (e.g. there is some relative performance bonus). The head of unit \(i\) maximizes therefore the utility function \(2\sqrt{p_i(1+s_i)-\alpha p_j(1+s_j)}-s_i\) where \(\alpha\in(0,1)\) is a parameter measuring the magnitude of relative performance pay. 
\begin{enumerate}
\item Assume \(p_1=p_2=1\) and derive the optimal inducement levels the unit leaders will choose.
\item Assume \(p_1=1.1\) and \(p_2=1\) and let \(\alpha=1/2\). Derive the optimal inducement levels the unit leaders will choose.
\item Compare your results with the results in exercise \ref{ex:sid2service}.
\end{enumerate}
\end{enumerate}
\end{document}